ИнКар.АвтоСервисМагазин/src/Catalogs/АСМ_Поколения/АСМ_Поколения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>АСМ_Поколения</name>
  <attributes>
    <name>Марка</name>
    <type>
      <types>CatalogRef.АСМ_Марки</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.АСМ_Модели</types>
    </type>
  </attributes>
</mdclass:Catalog>

ИнКар.АвтоСервисМагазин/src/Catalogs/АСМ_Модификации/АСМ_Модификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>АСМ_Модификации</name>
  <attributes>
    <name>ГодНачалаВыпуска</name>
    <type>
      <types>CatalogRef.АСМ_Годы</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодОкончанияВыпуска</name>
    <type>
      <types>CatalogRef.АСМ_Годы</types>
    </type>
  </attributes>
  <attributes>
    <name>Марка</name>
    <type>
      <types>CatalogRef.АСМ_Марки</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.АСМ_Модели</types>
    </type>
  </attributes>
  <attributes>
    <name>Поколение</name>
    <type>
      <types>CatalogRef.АСМ_Поколения</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТоплива</name>
    <type>
      <types>CatalogRef.АСМ_ТипыТоплива</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПривода</name>
    <type>
      <types>CatalogRef.АСМ_ТипыПривода</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТрансмиссии</name>
    <type>
      <types>CatalogRef.АСМ_ТипыТрансмиссии</types>
    </type>
  </attributes>
  <attributes>
    <name>Мощность</name>
    <type>
      <types>CatalogRef.АСМ_Мощности</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочийОбъем</name>
    <type>
      <types>CatalogRef.АСМ_Объемы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКузова</name>
    <type>
      <types>CatalogRef.АСМ_ТипыКузовов</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДверей</name>
    <type>
      <types>CatalogRef.АСМ_КоличествоДверей</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Комплектации</name>
    <attributes>
      <name>Комплектация</name>
      <type>
        <types>CatalogRef.АСМ_Комплектации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ИнКар.АвтоСервисМагазин/src/Catalogs/АСМ_Поколения/ManagerModule.bsl
//
//	Филимонов И.В.
//		+7 913 240 81 77
//		+7 905 084 20 06 (Telegram)
//		https://github.com/Shu-ler
//		
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает данные модификаций и комплектаций
// 
// Параметры:
//  Ссылка - СправочникСсылка.АСМ_Поколения - Поколение
// 
// Возвращаемое значение:
//  Структура - Опции отбора:
// * ДвигателиТрансмиссии - ТаблицаЗначений - Объем и мощность двигателя, привод, тип трансмиссии
// * ТипыКузовов - ТаблицаЗначений - Типы кузовов, количество дверей
// * Комплектации - ТаблицаЗначений - Комплектации
Функция ОпцииОтбора(Ссылка) Экспорт

	ОпцииОтбора = Новый Структура;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Поколение", Ссылка);
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
				   |	АСМ_Модификации.ТипТоплива КАК ТипТоплива,
				   |	АСМ_Модификации.ТипПривода КАК ТипПривода,
				   |	АСМ_Модификации.ТипТрансмиссии КАК ТипТрансмиссии,
				   |	АСМ_Модификации.Мощность КАК Мощность,
				   |	АСМ_Модификации.РабочийОбъем КАК РабочийОбъем,
				   |	ИСТИНА КАК Совместимо,
				   |	АСМ_Модификации.ТипПривода.Наименование + "", "" + АСМ_Модификации.ТипТрансмиссии.Наименование + "", "" +
				   |		АСМ_Модификации.ТипТоплива.Наименование + "" ("" + АСМ_Модификации.РабочийОбъем.Наименование + ""л/"" +
				   |		АСМ_Модификации.Мощность.Наименование + ""л.с.)"" КАК Расшифровка
				   |ИЗ
				   |	Справочник.АСМ_Модификации КАК АСМ_Модификации
				   |ГДЕ
				   |	АСМ_Модификации.Поколение В (&Поколение)
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ РАЗЛИЧНЫЕ
				   |	АСМ_Модификации.ТипКузова КАК ТипКузова,
				   |	АСМ_Модификации.КоличествоДверей КАК КоличествоДверей,
				   |	ИСТИНА КАК Совместимо,
				   |	АСМ_Модификации.ТипКузова.Наименование + "" ("" + АСМ_Модификации.КоличествоДверей.Наименование + "" дв.)"" КАК
				   |		Расшифровка
				   |ИЗ
				   |	Справочник.АСМ_Модификации КАК АСМ_Модификации
				   |ГДЕ
				   |	АСМ_Модификации.Поколение В (&Поколение)
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ РАЗЛИЧНЫЕ
				   |	ИСТИНА КАК Совместимо,
				   |	АСМ_МодификацииКомплектации.Комплектация.Наименование КАК Наименование
				   |ИЗ
				   |	Справочник.АСМ_Модификации.Комплектации КАК АСМ_МодификацииКомплектации
				   |ГДЕ
				   |	АСМ_МодификацииКомплектации.Ссылка.Поколение В (&Поколение)";
	ПакетОпций = Запрос.ВыполнитьПакет();

	ОпцииОтбора.Вставить("Агрегаты", ПакетОпций[0].Выгрузить());
	ОпцииОтбора.Вставить("ТипыКузовов", ПакетОпций[1].Выгрузить());
	ОпцииОтбора.Вставить("Комплектации", ПакетОпций[2].Выгрузить());

	Возврат ОпцииОтбора;

КонецФункции

// Находит элемент справочника по коду и наименованию.
// 
// Если отсутствует элемент справочника с заданным кодом и ИзменятьЭлемент = Истина - создает новый элемент
// Если наименование не соответствует заданному и ИзменятьЭлемент = Истина - производит переименование элемента
// 
// В случае неудачного поиска, создания или переименования элемента возвращает Неопределено
// 
// Параметры:
//  Код - Строка - Код
//  Наименование - Строка - Наименование
//  ИзменятьЭлемент - Булево - При необходимости изменять наименование или создавать новый элемент
//  СчетчикИзмененных - Число, Неопределено - Счетчик измененных элементов
// 
// Возвращаемое значение:
//  Неопределено, СправочникСсылка.АСМ_Марки - Найденный или созданный элемент
Функция НайтиПоКодуИНаименованию(ДанныеЗаполнения, ИзменятьЭлемент = Ложь, СчетчикИзмененных = Неопределено) Экспорт

	СправочникМенеджер = Справочники.АСМ_Поколения;

	Ссылка = АСМ_КаталогВызовСервера.НайтиСоздатьПоКодуИНаименованию(СправочникМенеджер,
																	 ДанныеЗаполнения,
																	 ИзменятьЭлемент,
																	 СчетчикИзмененных);
	Возврат Ссылка;

КонецФункции

#КонецОбласти

#КонецЕсли
